In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.232936 -1.484410
1    a  two  0.178452  0.757214
2    b  one  0.274280  0.244574
3    b  two -0.467942 -1.222171
4    a  one  1.707808  1.471479

In [4]:
df['data1'].groupby(df.key1).mean()

key1
a    0.706399
b   -0.096831
Name: data1, dtype: float64

In [7]:
means=df['data1'].groupby([df.key1,df.key2]).mean()

In [8]:
means.unstack()

key2       one       two
key1
a     0.970372  0.178452
b     0.274280 -0.467942

In [9]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.706399  0.248095
b    -0.096831 -0.488798

In [10]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one   0.970372 -0.006465
     two   0.178452  0.757214
b    one   0.274280  0.244574
     two  -0.467942 -1.222171